# Taps
tap "homebrew/bundle"
tap "homebrew/services"

# Core Development Tools
brew "git"
brew "node"
brew "mas"

# Essential CLI Tools
brew "wget"
brew "curl"
brew "tree"
brew "jq"           # JSON processor
brew "htop"         # Better top
brew "ripgrep"      # Fast grep alternative
brew "zoxide"       # Smart cd command

# Shell & Terminal
brew "zsh"
cask "warp"         # Modern terminal with AI

# Media & Graphics Libraries (for development)
brew "ffmpeg"
brew "tesseract"
brew "imageoptim-cli"

# Networking & Security
brew "openssl@3"
brew "ca-certificates"

# Programming Language Support
brew "python@3.12"
brew "python@3.13"

# Package Managers
brew "pnpm"

# Development Applications
cask "cursor"
cask "github"
cask "figma"

# Fonts
tap "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
cask "font-geist-mono"
cask "font-ia-writer-mono"
cask "font-ia-writer-duo"
cask "font-ia-writer-quattro"
# Note: Premium fonts (Dank Mono, Departure Mono) need manual installation

# Productivity Apps
cask "notion"
cask "raycast"
cask "bartender"
cask "cleanshot"
cask "hazel"

# Communication
# Microsoft Teams (pre-installed by employer)

# Media
cask "spotify"
cask "iina"
cask "calibre"
cask "obs"

# Utilities
cask "karabiner-elements"

# Browsers
cask "arc"

# Virtualization
cask "parallels"

# File Management
cask "transmit"

# System Utilities
cask "yam-display"
cask "flux"

# Design Tools
cask "zeplin"
cask "rotato"
cask "nucleo"

# Audio/Video Tools
cask "piezo"
cask "meetingbar"

# Development Tools
cask "dotnet-sdk8"
cask "dotnet-sdk8-0-400"

# Gaming
cask "steam"

# Document Processing
cask "pdf-squeezer"

# Remote Access
cask "teamviewer"

# Privacy
cask "tor-browser"

# Misc Development Libraries (keeping essential ones)
brew "jpeg-turbo"
brew "libpng"
brew "freetype"
brew "sqlite"
brew "readline"
brew "zstd"
brew "lz4"

# Mac App Store Applications
mas "Things 3", id: 904280696
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Photomator", id: 1444636541
mas "Gestimer", id: 990588172
mas "Mirror Magnet", id: 1563698880
mas "Keystroke Pro", id: 1572206224
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434