# Core CLI
brew "git"
brew "node"
brew "mas"
brew "zoxide"
brew "ffmpeg"
brew "tesseract"
brew "yt-dlp"

# Terminal & Editor
cask "warp"
cask "cursor"

# Productivity
cask "raycast"
cask "cleanshot"
cask "obsidian"

# Browsers
cask "arc"

# Media
cask "spotify"
cask "iina"
cask "calibre"
cask "obs"

# Design
cask "figma"
cask "nucleo"
cask "imageoptim"

# Utilities
cask "flux-app"
cask "meetingbar"
cask "pdf-squeezer"
cask "transmit"

# Personal only (skip on work machines)
# cask "mullvad-vpn"

# Development
cask "github"

# Fonts
cask "font-geist-mono"
cask "font-ia-writer-mono"
cask "font-ia-writer-duo"
cask "font-ia-writer-quattro"
cask "font-departure-mono"
cask "font-sf-mono"

# Mac App Store
mas "Things 3", id: 904280696
mas "Photomator", id: 1444636541
mas "Gestimer", id: 990588172
mas "Mirror Magnet", id: 1563698880
mas "Keystroke Pro", id: 1572206224
mas "Microsoft Outlook", id: 985367838
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
